In [1]:
import pandas as pd

In [4]:
date_list = [{'yyyy-mm-dd': '2000-06-27'},
             {'yyyy-mm-dd': '2002-09-24'},
             {'yyyy-mm-dd': '2005-12-20'}]
df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])
df

   yyyy-mm-dd
0  2000-06-27
1  2002-09-24
2  2005-12-20

In [7]:
def extract_year(column):
    return column.split('-')[0]

In [8]:
df['year'] = df['yyyy-mm-dd'].apply(extract_year)

In [9]:
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

In [13]:
def get_age(year, current_year):
    return current_year - int(year) + 1

In [14]:
df['age'] = df['year'].apply(get_age, current_year = 2024)

In [15]:
df

   yyyy-mm-dd  year  age
0  2000-06-27  2000   25
1  2002-09-24  2002   23
2  2005-12-20  2005   20

In [16]:
def introduce(row):
    return 'I was born in ' + str(row.year) + " and my age is " + str(row.age)

In [17]:
df['introduce'] = df.apply(introduce, axis=1)

In [18]:
df

   yyyy-mm-dd  year  age                            introduce
0  2000-06-27  2000   25  I was born in 2000 and my age is 25
1  2002-09-24  2002   23  I was born in 2002 and my age is 23
2  2005-12-20  2005   20  I was born in 2005 and my age is 20

In [19]:
job_list = [{'age': '20', 'job':'student'},
             {'age': '30', 'job':'developer'},
             {'age': '30', 'job':'teacher'}]
df = pd.DataFrame(job_list)
df

  age        job
0  20    student
1  30  developer
2  30    teacher

In [20]:
df.job = df.job.map({'student':1, 'developer':2, 'teacher':3})
df

  age  job
0  20    1
1  30    2
2  30    3